<template>
  <v-container>
    <v-row>
      <v-col>
        <v-tabs v-model="tab" background-color="transparent" grow>
          <v-tab>Метаграммы</v-tab>
          <v-tab>Анаграммы</v-tab>
          <v-tab>Шарады</v-tab>
          <v-tab>Логогрифы</v-tab>
        </v-tabs>
      </v-col>
    </v-row>
    <v-row>
      <v-col>
        <v-tabs-items id="custom-tab-items" v-model="tab">
          <v-tab-item>
            <div class="text-body-1">
              <p>
                Загадка, основанная на последовательном изменении в слове одной или нескольких букв, называется
                метаграммой. При каждой замене букв изменяется значение слова. Чтобы отгадать метаграмму, нужно
                заменить в слове одну букву другой, и тогда получите новое слово.
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>С К в полях меня найдете,</p>
                    <p>С Г романсы запоете.</p>
                    <p>С В в косички заплетете.</p>
                    <p>***</p>
                    <p>С Л я остров в океане,</p>
                    <p>С Р растаю вмиг в стакане.</p>
                    <p>***</p>
                    <p>C  Ч летаю над волною,</p>
                    <p>С  Л не дам волкам покою,</p>
                    <p>С  М рубашка-безрукавка,</p>
                    <p>С  З скачу в лесу по травке,</p>
                    <p>С  Г крепи меня к детали</p>
                    <p>Из железа или стали. </p>
                    <p>***</p>
                    <p>С  П людей я развлекаю,</p>
                    <p>Всякой скуки ярый враг.</p>
                    <p>С  З по полю удираю</p>
                    <p>От охотничьих собак.</p>
                    <p>***</p>
                    <p>С  Д из года в год встречаем,</p>
                    <p>С  Т за нами ходит вслед.</p>
                    <p>С  П в лесу мы замечаем,</p>
                    <p>С  Л труду наносим вред.</p>
                  </v-col>
                </v-row>
              </v-container>
              <p>
                Метаграммы - самые простые словестные задания. Следует вспомнить, что меняться могут и
                первые и последние буквы. Простота метаграмм делает это развлечение доступным и для
                младших членов семьи, деляших с вами досуг. Им тоже приятно будет сознавать себя способными к
                творческому и интеллектуальному времяпрепровождению.
              </p>
            </div>
          </v-tab-item>
          <v-tab-item>
            <div class="text-body-1">
              <p>
                Анаграммы образуются при перестановке в слове букв. Например: липа-пила. Добавлять или
                выбрасывать буквы не разрешается. А теперь попробуйте отгадать слова!!!
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>Я в пруду живу, жирею,</p>
                    <p>Переставьте буквы - вмиг</p>
                    <p>Превращусь я и в аллеи,</p>
                    <p>И в лужайки и в цветник.</p>
                    <p>***</p>
                    <p>В океанах он живет</p>
                    <p>И мала ему река.</p>
                    <p>Буквы ставь наоборот -</p>
                    <p>Будет дергаться щека.</p>
                    <p>***</p>
                  </v-col>
                </v-row>
              </v-container>
            </div>
          </v-tab-item>
        </v-tabs-items>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  name: 'Fun',
  data () {
    return {
      tab: null
    }
  }
}
</script>

<style scoped>
#custom-tab-items {
    background-color: transparent !important;
}
</style>
