<template>
  <v-container>
    <v-row>
      <v-col>
        <v-tabs v-model="tab" background-color="transparent" grow>
          <v-tab>Метаграммы</v-tab>
          <v-tab>Анаграммы</v-tab>
          <v-tab>Шарады</v-tab>
          <v-tab>Логогрифы</v-tab>
        </v-tabs>
      </v-col>
    </v-row>
    <v-row>
      <v-col>
        <v-tabs-items id="custom-tab-items" v-model="tab">
          <v-tab-item>
            <div class="text-body-1">
              <p>
                Загадка, основанная на последовательном изменении в слове одной или нескольких букв, называется
                метаграммой. При каждой замене букв изменяется значение слова. Чтобы отгадать метаграмму, нужно
                заменить в слове одну букву другой, и тогда получите новое слово.
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>С К в полях меня найдете,</p>
                    <p>С Г романсы запоете.</p>
                    <p>С В в косички заплетете.</p>
                    <p>***</p>
                    <p>С Л я остров в океане,</p>
                    <p>С Р растаю вмиг в стакане.</p>
                    <p>***</p>
                    <p>C  Ч летаю над волною,</p>
                    <p>С  Л не дам волкам покою,</p>
                    <p>С  М рубашка-безрукавка,</p>
                    <p>С  З скачу в лесу по травке,</p>
                    <p>С  Г крепи меня к детали</p>
                    <p>Из железа или стали. </p>
                    <p>***</p>
                    <p>С  П людей я развлекаю,</p>
                    <p>Всякой скуки ярый враг.</p>
                    <p>С  З по полю удираю</p>
                    <p>От охотничьих собак.</p>
                    <p>***</p>
                    <p>С  Д из года в год встречаем,</p>
                    <p>С  Т за нами ходит вслед.</p>
                    <p>С  П в лесу мы замечаем,</p>
                    <p>С  Л труду наносим вред.</p>
                  </v-col>
                </v-row>
              </v-container>
              <p>
                Метаграммы - самые простые словестные задания. Следует вспомнить, что меняться могут и
                первые и последние буквы. Простота метаграмм делает это развлечение доступным и для
                младших членов семьи, деляших с вами досуг. Им тоже приятно будет сознавать себя способными к
                творческому и интеллектуальному времяпрепровождению.
              </p>
            </div>
          </v-tab-item>
          <v-tab-item>
            <div class="text-body-1">
              <p>
                Анаграммы образуются при перестановке в слове букв. Например: липа-пила. Добавлять или
                выбрасывать буквы не разрешается. А теперь попробуйте отгадать слова!!!
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>Я в пруду живу, жирею,</p>
                    <p>Переставьте буквы - вмиг</p>
                    <p>Превращусь я и в аллеи,</p>
                    <p>И в лужайки и в цветник.</p>
                    <p>***</p>
                    <p>В океанах он живет</p>
                    <p>И мала ему река.</p>
                    <p>Буквы ставь наоборот -</p>
                    <p>Будет дергаться щека.</p>
                    <p>***</p>
                    <p>По мне движется к сердцу кровь,</p>
                    <p>Меня ищут на сгибах руки.</p>
                    <p>Если ж, буквы смешав,</p>
                    <p>Мы расставим их вновь,</p>
                    <p>То получим названье реки.</p>
                    <p>***</p>
                    <p>Воздух в шины я вдуваю,</p>
                    <p>Жизнь несу я колесу.</p>
                    <p>Если слоги мы смешаем,</p>
                    <p>Буду деревом в лесу.</p>
                    <p>***</p>
                    <p>Не раз в оркестре я звучала,</p>
                    <p>Мой голос струйный так певуч.</p>
                    <p>Но Ф мое поставь с начала,</p>
                    <p>И я во тьму направлю луч.</p>
                  </v-col>
                </v-row>
              </v-container>
            </div>
          </v-tab-item>
          <v-tab-item>
            <div class="text-body-1">
              <p>
                В шарадах загаданное слово состоит из нескольких частей, каждая из которых представляет
                собой отдельную смысловую единицу. Например, пар-ус, вино-град, клуб-ника. Для зашифровывания
                слова вначале в поэтической форме дают характеристики каждой из его частей, потом -
                общую характеристику слова. И получаются такие вот стихи-шарады:
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>Из писка птиц мой первый слог возьмите,</p>
                    <p>Второй - с бараньей головы.</p>
                    <p>Откройте печь и там найдите</p>
                    <p>То, что не раз едали вы.</p>
                    <br>
                    <p>Нота - мой первый слог,</p>
                    <p>Поставь с ней рядом предлог</p>
                    <p>И, разгадав загадку до конца,</p>
                    <p>Получишь выражение лица.</p>
                    <br>
                    <p>Первый слог - мужское имя,</p>
                    <p>Буква гласная - второй.</p>
                    <p>Слово в целом - знак почтовый.</p>
                    <p>Угадаете - какой?</p>
                    <br>
                    <p>Мой первый слог - в линейках нотных,</p>
                    <p>Два остальных - защита у животных.</p>
                    <p>А целое соединит всегда</p>
                    <p>Деревни, села, города.</p>
                    <br>
                    <p>Слог первый мой - предлог.</p>
                    <p>Второй слог - летний дом.</p>
                    <p>А целое порой</p>
                    <p>Решается с трудом.</p>
                  </v-col>
                </v-row>
              </v-container>
              <p>
                Теперь, когда вы уяснили принцип сочинения шарад, можно и самим попробовать. Кстати, в прежние времена
                гостей развлекали еще и инсценировками шарад, костюмированными постановками этих забавных стихов.
                Хорошие традиции не стоит забывать.
              </p>
            </div>
          </v-tab-item>
          <v-tab-item>
            <div class="text-body-1">
              <p>
                В логогрифе любая буква может быть убрана и наоборот - может быть присоединена новая. К примеру,
                в слове "плот" появляется новая буква И.. Получаем слово "пилот". Теперь попробуем зашифровать такие
                превращения.
              </p>
              <v-container class="ml-10">
                <v-row>
                  <v-col>
                    <p>Любят все нас собирать</p>
                    <p>После дождика в лесу,</p>
                    <p>А как букву Г отнять -</p>
                    <p>Будем плавать мы в пруду.</p>
                    <br>
                    <p>По морю двигаюсь я вплавь,</p>
                    <p>Хвостом хоть лодку опрокину.</p>
                    <p>Но букву Р в меня прибавь -</p>
                    <p>И сразу островом застыну.</p>
                    <br>
                    <p>На берегу морском</p>
                    <p>Все время я валяюсь.</p>
                    <p>А выбрось мягкий знак -</p>
                    <p>Вверх птицей устремляюсь.</p>
                    <br>
                    <p>Известное я блюдо.</p>
                    <p>Когда прибавишь М -</p>
                    <p>Жужжать, метаться буду,</p>
                    <p>Надоедая всем.</p>
                  </v-col>
                </v-row>
              </v-container>
              <p>
                Эта словесная игра намного сложнее. Тем не менее, есть немало людей, которые увлекаются ею.
                Называется этот вид словесной эквилибристики "Палиндромы. "Это фразы, которые читаются одинаково -
                как слева направо, так и наоборот - справа налево.
              </p>
            </div>
          </v-tab-item>
        </v-tabs-items>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  name: 'Fun',
  data () {
    return {
      tab: null
    }
  }
}
</script>

<style scoped>
#custom-tab-items {
    background-color: transparent !important;
}
</style>
