<template>
  <v-container>
    <v-row>
      <v-col>
        <div class="text-body-1 mt-5" style="color: #0000FF">
          <p>
            - Мама, наш учитель
            никогда не видел лошадей!
          </p>

          <p>- Почему ты так думаешь?</p>

          <p>
            - Я нарисовал лошадь, а он
            спрашивает: &quot;Это что за уродина?&quot;
          </p>

          <br>

          <p>
            - Почему уроки за тебя всегда делает
            отец?
          </p>

          <p>
            - А у мамы никогда нет свободного
            времени.
          </p>

          <br>
          <p>
            - Придумай предложение с
            деепричастием &quot;несмотря&quot;.
          </p>

          <p>
            - Я делала уроки, не смотря
            телевизор.
          </p>

          <br>

          <p>- Какие ты знаешь кости черепа?</p>

          <p>
            - Височные, теменные и...
            подзатыльник.
          </p>

          <br>

          <p>- Сколько будет сто умножить на два?</p>

          <p>- Сто карбованцев или сто долларов?</p>

          <br>

          <p>Инспектор:</p>

          <p>
            - Крылов, почему вы вчера опять не
            пришли на уроки?
          </p>

          <p>
            - У меня сильно голова болела, Петр
            Петрович.
          </p>

          <p>
            - Ах, что за пустяки! Ведь головная
            боль просто происходит от давления воздуха на
            пустую голову; уж лучше бы вам прямо сознаться в
            вашей лени. Если бы я обращал внимание на
            головную боль, то никогда бы не явился в классы.
          </p>

          <br>

          <p>
            Учитель (останавливая студента на
            улице в 2 часа дня):
          </p>

          <p>
            - Почему это вы гуляете в неурочный
            час?
          </p>

          <p>
            - Как в неурочный час? Теперь идет
            урок информатики.
          </p>

          <br>

          <p>
            В классе. Учитель истории читает
            лекцию. - Галилей, господа, открыл движение
            Солнца, Колумб открыл Америку, кто-то выдумал
            порох, Ньютон открыл закон всемирного тяготения -
            и они все пострадали за свои открытия. Из других
            ученых: Коперник, Гутенберг, Стефенсон... Кто, черт
            возьми, открыл форточку? Хотите, чтобы и я
            пострадал из-за нее!..
          </p>

          <br>

          <p>Директор гимназии:</p>

          <p>
            - Послушайте, Остолопов! Вы
            поступили гадко; вы должны были краснеть со стыда
            при одной мысли о таком мерзком поступке...
          </p>

          <p>
            - А я думал, что мне совсем излишне
            краснеть за этот поступок: мой папаша мне сказал,
            что он за меня краснеет.
          </p>

          <br>

          <p>
            Учитель истории рассказывает о
            битве при Фермопилах:
          </p>

          <p>
            - Перед битвой персидский царь
            послал к грекам посла с требованием... перестать
            разговаривать, Петров, вам говорят... с
            требованием сложить... книги, Шахов, должны лежать
            в столе, а не раскрытыми на нем... с требованием
            сложить оружие.
          </p>

          <p>
            Гордый ответ греков был следующий...
            вы, Карпов, подвиньтесь полевее, чтобы я мог
            видеть, что за глупости Коржевский делает... да,
            ответ был: приди и возьми. Когда грекам объявили,
            что число персов так велико, что от них
            затемнялось солнце, тогда предводитель греков -
            Леонид - сказал... Право, Касаткин, если вы будете
            баловаться, то я вас к стенке поставлю. Леонид
            сказал: тем лучше, мы будем сражаться в тени.
            Через четыре дня началось сражение. Наконец,
            изменник по имени... Соколов, давайте сюда
            веревку, здесь не место играть!... Да, Эфиальт
            показал персам дорогу через горы, и тогда между
            греками послышались крики ужаса... кто, черт
            возьми, бросается жжеными бумажками?..
          </p>

          <br>

          <p>Учитель:</p>

          <p>- Амарилло!</p>

          <p>- Здесь!</p>

          <p>- Чем занимается ваш отец?</p>

          <p>
            - Я не могу этого сказать: это -
            секрет.
          </p>

          <p>- Мне это непременно нужно знать...</p>

          <p>- Мой папа служит в музее...</p>

          <p>- Кто же он там?</p>

          <p>- Он - женщина с бородой.</p>

          <br>

          <p>Ученик:</p>

          <p>
            - Господин учитель, что вы написали
            в моей тетрадке по чистописанию? Не могу
            прочитать!
          </p>

          <p>- &quot;Пиши разборчивей!&quot;</p>

          <br>

          <p>
            - Нет, простите! Мы не можем взять
            вас в учительницы...
          </p>

          <p>
            - А почему? Я педагогические курсы
            окончила...
          </p>

          <p>
            - Нам это все едино, а рост у вас
            маленький и голос тоненький. Вас наши дети не
            станут бояться... Нам надо такую, чтобы как
            крикнула, так все языки прикусили!
          </p>

          <br>

          <p>
            В гимназии идет лабораторная
            работа. Иванов по ходу задает вопросы.
          </p>

          <p>Учитель:</p>

          <p>
            - Прежде, чем спросить, Иванов,
            поднимите руку вверх. Кровь прильет к голове и
            ваш мозг будет работать лучше. Тогда, возможно, и
            вопрос отпадет сам по себе.
          </p>

          <br>

          <p>
            Как-то учительница по кулинарии
            миссис Притчард расхваливала известные только
            ей рецепты исключительных соусов. Когда девочки
            встали к плите и начали готовить, она добавила:
          </p>

          <p>
            - Не забудьте, что надо пользоваться
            деревянными ложками.
          </p>

          <p>
            Одна ученица помешивала соус и
            гадала - почему именно деревянными? Может, дело в
            теплопроводности? Девочка подошла к миссис
            Притчард, чтобы проверить свою догадку.
            Учительница, выслушав ее, рассмеялась:
          </p>

          <p>
            - Да нет, просто если б вы все разом
            застучали металлическими ложками о
            металлические кастрюли, я бы сошла с ума!
          </p>
        </div>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  name: 'AboutSchool'
}
</script>

<style scoped>

</style>
