<template>
  <v-container>
    <v-row>
      <v-col>
        <div class="text-body-1 mt-5" style="color: #FF0000">
          <p>
            В детском садике повариха
            спросила малышей, какую яичницу они хотят на
            обед.
          </p>

          <p>
            - Мне - с открытыми глазками! -
            заявил один.
          </p>

          <p>
            - А мне - с прищуренными! -
            поддержала его бойкая девочка.
          </p>

          <p>
            - А мне... а мне - совсем сонную! -
            нашелся Петя.
          </p>

          <br>

          <p>
            Незадолго до Рождества к
            бабушке привезли пятилетнего внука. Малыш с
            дороги устал и его положили спать. Когда он
            проснулся в плохом настроении и захныкал,
            бабушка сказала:
          </p>

          <p>
            - Если не будешь капризничать.
            Дед Мороз подарит тебе башенный кран!
          </p>

          <p>
            - Здорово! - обрадовался внучек,
            - теперь у меня их будет два!
          </p>

          <p>
            - Почему два? - удивилась
            бабушка.
          </p>

          <p>
            - А второй я нашел у тебя под
            кроватью.
          </p>

          <br>

          <p>
            Милиционер задержал машину,
            нарушившую правила уличного движения. Маленький
            мальчик, сын владельца машины, с ужасом наблюдая,
            как милиционер бранит его папу и составляет на
            него какой-то акт, высунулся из окошечка и
            попросил:
          </p>

          <p>
            - Дяденька, отпустите нас! Мы за
            мир!
          </p>

          <br>

          <p>
            Ребенок никак не засыпает.
            Мама спрашивает мальчика:
          </p>

          <p>- Может тебе спеть колыбельную?</p>

          <p>
            - Мама, разве я заслужил такое
            наказание? Ты сначала поговори со мной
            по-хорошему.
          </p>

          <br>

          <p>
            Мама поинтересовалась у
            своего малыша:
          </p>

          <p>
            - Что бы ты хотел получить на
            день рождения?
          </p>

          <p>
            - Лошадку, пистолет и три дня не
            умываться!
          </p>

          <br>

          <p>
            Во дворе мальчик таскает на
            веревочке пустую консервную банку.
          </p>

          <p>
            - Что ты делаешь? - подбежала к
            нему девочка.
          </p>

          <p>
            - Не видишь что ли - собаку
            выгуливаю.
          </p>

          <p>
            - Тогда немедленно надень на
            нее намордник!
          </p>

          <br>

          <p>
            К старшей сестре пришел
            ухажер. Младший братик спрашивает у него:
          </p>

          <p>
            - А вы фокусы умеете
            показывать?
          </p>

          <p>- К сожалению, нет.</p>

          <p>
            - А мой папа умеет. Он сказал,
            что вы вылетите отсюда как пробка!
          </p>

          <br>

          <p>Сестра братику:</p>

          <p>
            - Коля, ты только что ходил
            смотреть на Луну и теперь этими же руками берешь
            бутерброд!
          </p>

          <br>

          <p>
            Перед дверью дома сидит
            маленький мальчик. К нему подходит какой-то
            человек и спрашивает:
          </p>

          <p>- Папа дома?</p>

          <p>-Да.</p>

          <p>
            Мужчина звонит, но никто не
            открывает. Тогда он зло говорит мальчику:
          </p>

          <p>
            - Ты говоришь, что отец дома,
            тогда почему никто не открывает?
          </p>

          <p>- Не знаю. Мы тут не живем.</p>

          <br>

          <p>
            Маленький племянник
            спрашивает у своего пожилого дяди:
          </p>

          <p>- А вы что - в лесу родились?</p>

          <p>- Почему ты так думаешь?</p>

          <p>
            - Да папа сказал: &quot;Опять к нам
            приперся этот старый пень!&quot;
          </p>
        </div>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  name: 'НumorInShortPants'
}
</script>

<style scoped>

</style>
