<template>
  <v-container>
    <div class="text-h4 mb-5" style="color: #0000A0; text-align: center">
      Школа исскуств
    </div>
    <div class="text-body-1" style="color: #008080; text-align: center">
      <p>Школа искусств имеет несколько направлений.</p>
      <p>Первое - хореографическое (классический танец, народный танцы, историко-бытовой ).</p>
      <p>Второе - музыкальное (фортепиано, баян, скрипка, виолончель и духовые инструменты.).</p>
      <p>Школа имеет множество ансамблей. Ансамбль скрипачей, баянистов, виолончелистов.</p>
      <p>А также всем известные ансамбли "Шонанпыл" и "Русские узоры".</p>
    </div>
  </v-container>
</template>

<script>
export default {
  name: 'Art'
}
</script>

<style scoped>

</style>
