<template>
  <v-container>
    <div align="center" class="text-h4" style="color: #800080">
      Экспериментальная школа-комплекс № 18
    </div>
    <div align="center" class="text-h4" style="color: #800080">
      (ЭШК № 18)
    </div>
    <div class="text-body-1 mt-5" style="color: #0000FF">
      <p>
        В 1961 году на окраине города - трехэтажное здание, школа N 18. В 1993 году школа становится
        целым комплексом. Она делится на Школу искусств, спортивную школу, оздоровительный центр,
        общеобразовательную школу, начальную школу, производственный комплекс и школу развития дошкольников.
      </p>
      <p>
        Школа развития для дошколят взаимодействует с двумя детскими садами. Одним
        из них является сад &quot;Школа детства&quot;. В нем дети занимаются три года, с 1 по 3 класс. В 5 класс
        они приходят в ЭШК N 18.
      </p>
      <p>
        Общеобразовательная школа имеет две ступени. Первая с 5 по 9 класс -
        &quot;основная&quot; или &quot;самоопределения&quot;.
        Вторая ступень 10,11 класс - Школа становления.
      </p>
      <p>
        10,11 классы делятся по профилю: политехнический, педагогический и медицинский.
      </p>
    </div>
    <div class="text-body-1">
      <p>
        Политехнический -&nbsp; на базе Марийского Государственного технического университета
      </p>
      <p>
        Педагогический - на базе Марийского Государственного педагогического
        института.&nbsp; 3&nbsp; факультета: дошкольное воспитание, иностранные языки, спортивный
        факультет.
      </p>
      <p>
        Медицинский - Кировский медицинский институт.
      </p>
    </div>
    <div class="text-body-1" style="color: #1D6956">
      <p>
        Каждый ученик Экспериментальной школы-комплекс N 18 может реализовать свои способности. Ученики школы
        становились и становятся победителями, дипломантами, лауреатами всевозможных конкурсов
        и республиканских олимпиад.
      </p>
    </div>
    <div class="text-h4" align="center" style="color: #1D6956">
      И у вас есть шанс учиться в нашей школе !!!
    </div>
  </v-container>
</template>

<script>

export default {
  name: 'SchoolMain'
}
</script>

<style scoped>
.FtMainBody {
  background-repeat: repeat;
  height: 100%;
}
</style>
