<template>
  <v-container>
    <div class="text-h4 mb-5" style="text-align: center; color: #400040;">
      Спортивкая школа
    </div>
    <div class="text-body-1" style="text-align: center; color: #808080;">
      <p>
        Спортивная школа занимает целое крыло. Сюда входят различные залы,
        раздевалки,  бассейн, тренажерный зал. Наш бассейн не имеет аналогов в Марий Эл.
      </p>
      <p>
        Основным направлением является баскетбол. Но можно заниматься и футболом,
        и греко-римской борьбой, и аэробикой, и плаваньем, и т.д.
      </p>
      <p>
        Команды ЭШК № 18 не раз занимали первые места в городских и республиканских соревнованиях.
      </p>
    </div>
  </v-container>
</template>

<script>
export default {
  name: 'Sport'
}
</script>

<style scoped>

</style>
